# Direction Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraintAngleFromFixedDir..::..Direction Property
RebarShapeConstraintAngleFromFixedDir Class See Also
---
A fixed direction in UV-space. The parameter will drive the segment's angle relative to this direction.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public UV Direction { get; set; }
```

Visual Basic
---
```text
Public Property Direction As UV
	Get
	Set
```

Visual C++
---
```text
public:
property UV^ Direction {
	UV^ get ();
	void set (UV^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: direction has zero length. |

# See Also
RebarShapeConstraintAngleFromFixedDir Class
Autodesk.Revit.DB.Structure Namespace